def build_trie(words):
    trie = {}
    for word in words:
        node = trie
        for char in word:
            if char not in node:
                node[char] = {}
            node = node[char]
        node['$'] = True  # признак конца слова
    return trie

def is_bad_word(trie, word):
    node = trie
    for char in word:
        if char not in node:
            return False
        node = node[char]
    return '$' in node  # слово заканчивается здесь?

def end_bad_word(trie, word):
    node = trie
    for char in word:
        if char not in node:
            return False
        node = node[char]
        if '$' in node:
            return True
    return '$' in node  # слово заканчивается здесь?

bad_words = {
    # б‑группа
    "бля", "блять", "блядина", "блядь", "блядюга", "блядовать", "блядский",
    # е‑группа
    "ебанутый", "ебаный", "ебан", "ебать", "ебаться", "ебался", "ебало", "ебло",
    "ебалоед", "ебальник", "ебанина", "ебанье", "ебануть", "ебанулся",
    "ебашить", "ебашит", "ебало", "ебята", "ебало", "ебла", "еблище",
    "ебунок", "ебун", "ебанец", "ебанец", "ебирь", "ебаная","проебали", "заебали", "выебали", "ебанутые",
    # нахуй‑группа
    "нахуй", "нахер", "нахуя", "нахрен", "нахуя", "нахуяриваешь", "отъебись", "отъебись",
    "отъебать", "ебись", "ебете",
    # хуй‑группа
    "хуй", "хуи", "хую", "хуя", "хуёв", "хуе", "хуюк", "хуйло", "хуйня", "хуйней", "хуя",
    "хуйню", "охуел", "ахуел", "охуеть", "ахуеть", "охуелся", "ахуелся", "похуй", "захуй",
    # пизд‑группа
    "пизда", "пиздец", "пиздеть", "пиздюк", "пиздуй", "пиздануть", "пиздануться",
    "пиздануть", "пизданул", "пизданет", "пиздану", "пиздюлина", "пиздецкий",
    "пиздатый", "поебать", "попиздеть", "припиздить",
    # сук‑группа
    "сука", "суки", "сукин", "сукины", "сучка", "сучий", "сучье", "суковина",
    # мудак‑группа
    "мудак", "мудаки", "мудила", "мудень", "мудозвон", "мудосраный",
    # долбаеб‑группа
    "долбаеб", "долбоеб", "долбаёб", "долбоёб", "долбить", "долбят", "долбёжка", "дубльбот","долбаебы",
    # заеб‑группа
    "заебал", "заебу", "заебись", "заебало", "заебать", "заебаться", "заебываешь", "ебану", "заебали",
    # сран‑группа
    "ссаный", "ссать", "сру", "срал", "сраный", "срат", "сраное", "срач",
    # дроч‑группа
    "дрочить", "дрочка", "подрочить", "подрочка",
    # пидор‑группа
    "пидор", "пидорас", "пидрик", "пидрило", "пидер", "пидорасик",
    # шл‑группа
    "шлюха", "шлюхи", "шлюшка", "шлюх",
    # хер‑группа
    "хер", "хера", "хере", "херов", "херовый", "херово", "херня",
    # залуп‑группа
    "залупа", "залупить", "залупаться", "залупился", "залупень", "злупень",
    # манд‑группа
    "манда", "мандеть", "манду", "мандюшонок",
    # уеб‑группа
    "уебок", "уебан", "уебало", "уебаться", "уёбок", "уёбан",
    # смешанные
    "гондон", "захуярить", "захуярю", "захуярил", "обосраться", "обосрался",
    "обосраться", "похуист", "пофигист", "член",
}
